Revit 2027 API
GBXMLExportOptions Properties
The GBXMLExportOptions type exposes the following members.
Properties
Name | Description
ExportAnalyticalSystems | Obsolete.
 Indicates if the gbXML should contain analytical system elements (e.g., Water Loop, Air System, and Zone Equipment).
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
Top
See Also
Reference
GBXMLExportOptions Class
Autodesk.Revit.DB Namespace